# Алфавит Морса в слова
MORSE_CODE = {'A': '.-', 'B': '-...', 'C': '-.-.',
            'D': '-..', 'E': '.', 'F': '..-.',
            'G': '--.', 'H': '....', 'I': '..',
            'J': '.---', 'K': '-.-', 'L': '.-..',
            'M': '--', 'N': '-.', 'O': '---',
            'P': '.--.', 'Q': '--.-', 'R': '.-.',
            'S': '...', 'T': '-', 'U': '..-',
            'V': '...-', 'W': '.--', 'X': '-..-',
            'Y': '-.--', 'Z': '--..',
            '0': '-----', '1': '.----', '2': '..---',
            '3': '...--', '4': '....-', '5': '.....',
            '6': '-....', '7': '--...', '8': '---..',
            '9': '----.'
            }
answers = []


word = input("В ведите солово в верхнем регистре на английском")


# word исходное слово
def morse_encode(word):
    word_encode = []
    for latter in word:
        word_encode.append(MORSE_CODE.get(latter, ''))
    print('Зашифрованное слово')
    return " ".join(word_encode)



print(morse_encode(word))



